[{
    "title": "Marriage Unplugged",
    "id": "6",
    "releaseYear": "10/28/2024",
    "overview": "Unhappy in their marriage, Suzanna and Andrew buy a male sex robot called James, who consequently uncovers the deep fractures in their relationship.",
    "posterUrl": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/3H99Wl52sBPRqXZ3LJjgODOLfwX.jpg"
 
},{
    "title": "Victoria",
    "id": "7",
    "releaseYear": "01/16/2021",
    "overview": "Victoria is a woman betrayed, now on a mission for revenge and destroying anything that gets in her way.",
    "posterUrl": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/aOSTW7ZitFAff06mZVXUnktejHY.jpg"
 
},{
    "title": "A Minecraft Movie",
    "id": "8",
    "releaseYear": "04/03/2025",
    "overview": "Four misfits find themselves struggling with ordinary problems when they are suddenly pulled through a mysterious portal into the Overworld: a bizarre, cubic wonderland that thrives on imagination. To get back home, they'll have to master this world while embarking on a magical quest with an unexpected, expert crafter, Steve.",
    "posterUrl": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/yFHHfHcUgGAxziP1C3lLt0q2T4s.jpg"
 
},{
    "title": "Phantom",
    "id": "9",
    "releaseYear": "01/18/2023",
    "overview": "In 1933, when Korea was under Japanese occupation, five people in Gyeongseong are suspected to be Phantom spies of the anti-Japanese organization.",
    "posterUrl": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/n1rxZ4wovf7BYhLNwCqde8I3I2N.jpg"
 
},{
    "title": "My Fault ",
    "id": "10",
    "releaseYear": "06/08/2023",
    "overview": "Noah must leave her city, boyfriend, and friends to move into William Leister's mansion, the flashy and wealthy husband of her mother Rafaela. As a proud and independent 17 year old, Noah resists living in a mansion surrounded by luxury. However, it is there where she meets Nick, her new stepbrother, and the clash of their strong personalities becomes evident from the very beginning.",
    "posterUrl": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/w46Vw536HwNnEzOa7J24YH9DPRS.jpg"
 
},{
    "title": "Site",
    "id": "11",
    "releaseYear": "03/08/2025",
    "overview": "After a terrifying encounter at an abandoned government test site, a small town family man begins seeing haunting visions of a past that threatens to destroy his present.",
    "posterUrl": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/wydPRb0Zs4lBANfvu0iEEpxULyv.jpg"
 
},{
    "title": "The Fantastic 4: First Steps",
    "id": "12",
    "releaseYear": "07/24/2025 ",
    "overview": "Against the vibrant backdrop of a 1960s-inspired, retro-futuristic world, Marvel's First Family is forced to balance their roles as heroes with the strength of their family bond, while defending Earth from a ravenous space god called Galactus and his enigmatic Herald, Silver Surfer.",
    "posterUrl": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/x26MtUlwtWD26d0G0FXcppxCJio.jpg"
 
}
]